tutorials/fluidSolidInteraction/beamInCrossFlow/overset/0/fluid/regionIndex
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      regionIndex;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16832
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    oversetFaces
    {
        type            calculated;
        value           nonuniform 0();
    }
    outer_front
    {
        type            calculated;
        value           uniform 0;
    }
    symmetry_front
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    bottom_front
    {
        type            calculated;
        value           uniform 0;
    }
    interface
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    left
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
